In [6]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns

In [7]:
df = pd.read_csv("../Data/ships.txt",sep="\t",na_values=['None'],dtype={"Tons":"float64"})

In [8]:
df.head()

                     Name                 Role    Tons   Propulsion      Type
0  Henrietta (ship, 1861)  Blockade Operations   205.0         Sail  Schooner
1   USS Albermarle (1863)  Blockade Operations   200.0        Steam  Schooner
2   USS Ammonoosuc (1864)  Blockade Operations  9850.0        Steam   Frigate
3          USS Ben Morgan  Blockade Operations   407.0         Sail  Schooner
4     USS Brooklyn (1858)  Blockade Operations  2532.0  Steam, Sail     Sloop

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 739 entries, 0 to 738
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        739 non-null    object
 1   Role        739 non-null    object
 2   Tons        732 non-null    float64
 3   Propulsion  739 non-null    object
 4   Type        666 non-null    object
dtypes: float64(1), object(4)
memory usage: 29.0+ KB

In [10]:
df.describe()

              Tons
count   732.000000
mean    659.206421
std     767.838514
min      10.000000
25%     200.000000
50%     421.000000
75%     883.000000
max    9850.000000

In [11]:
df['Role'].isna().sum()

0

In [12]:
pivot = pd.pivot_table(df,values='Propulsion',index='Role',aggfunc='count')
result = pivot.sort_values("Propulsion",ascending=False)
print(result)

                     Propulsion
Role
Gunboat                     435
Transport                    96
Blockade Operations          57
Tug                          55
Obstacle                     45
Monitor                      29
Tender                       10
Torpedo Boat                  5
Balloon Barge                 1
Lighthouse Tender             1
Minesweeper                   1
Patrol                        1
Pilot Boat                    1
Reconnaissance                1
Submarine                     1

In [13]:
series=pd.value_counts(df.Role)
mask = series.lt(2)
df['Function']=np.where(df.Role.isin(series[mask].index),'Other',df.Role)
print(df)

                       Name                 Role    Tons   Propulsion  \
0    Henrietta (ship, 1861)  Blockade Operations   205.0         Sail
1     USS Albermarle (1863)  Blockade Operations   200.0        Steam
2     USS Ammonoosuc (1864)  Blockade Operations  9850.0        Steam
3            USS Ben Morgan  Blockade Operations   407.0         Sail
4       USS Brooklyn (1858)  Blockade Operations  2532.0  Steam, Sail
..                      ...                  ...     ...          ...
734       USS Young America              Tender    173.0        Steam
735                USS Zeta            Transport    60.0        Steam
736              USS Zouave              Tender    127.0        Steam
737             Valparaiso              Obstacle   402.0         Sail
738            William Lee              Obstacle   311.0         Sail

         Type             Function
0    Schooner  Blockade Operations
1    Schooner  Blockade Operations
2     Frigate  Blockade Operations
3    Schooner  Blockade Operations
4       Sloop  Blockade Operations
..        ...                  ...
734    Tender              Tender
735   Steamer            Transport
736    Tender              Tender
737    Stoned             Obstacle
738    Stoned             Obstacle

[739 rows x 6 columns]

In [14]:
pivot = pd.pivot_table(df,index='Function')
print(result)

                     Propulsion
Role
Gunboat                     435
Transport                    96
Blockade Operations          57
Tug                          55
Obstacle                     45
Monitor                      29
Tender                       10
Torpedo Boat                  5
Balloon Barge                 1
Lighthouse Tender             1
Minesweeper                   1
Patrol                        1
Pilot Boat                    1
Reconnaissance                1
Submarine                     1

In [15]:
df[df.Role=='Balloon Barge']

,Name,Role,Tons,Propulsion,Type,Function
604,USS George Washington Parke Custis (1861),Balloon Barge,1726.0,Towed,barge balloon,Other

In [16]:
pivot = pd.pivot_table(df,index='Role',values="Tons",aggfunc='median')
result = pivot.sort_values("Tons",ascending=False)
print(result)

                       Tons
Role
Balloon Barge        1726.0
Blockade Operations  1457.0
Monitor              1300.0
Torpedo Boat         1175.0
Transport             496.5
Gunboat               451.5
Obstacle              320.0
Lighthouse Tender     305.0
Reconnaissance        300.0
Submarine             275.0
Pilot Boat            122.0
Tug                   103.0
Minesweeper            81.0
Tender                 78.5
Patrol                 50.0

In [17]:
TotalDisplacement = df.Tons.sum()
print(TotalDisplacement)

482539.1

In [18]:
(df
 .groupby("Role")
 .sum()
 .sort_values("Tons",ascending=False)
)

                         Tons
Role
Gunboat              249869.0
Blockade Operations   92982.0
Transport             65947.0
Monitor               44567.0
Obstacle              12897.0
Tug                    8670.1
Torpedo Boat           3732.0
Balloon Barge          1726.0
Tender                 1016.0
Lighthouse Tender       305.0
Reconnaissance          300.0
Submarine               275.0
Pilot Boat              122.0
Minesweeper              81.0
Patrol                   50.0

In [19]:
pivot = pd.pivot_table(df,index='Function',values="Tons",aggfunc='sum',margins = True, margins_name='Total')
p = pivot.sort_values("Tons",ascending=True)
p.columns = ["Disp (x 1K tons)"]
display(p.style.format(formatter={('Disp (x 1K tons)'): lambda x: "{:,.1f}".format(x*1e-3)}))